### Задание 1
---
SW_1
```
SW_1#show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/4, Fa0/5, Fa0/6, Fa0/7
                                                Fa0/8, Fa0/9, Fa0/10, Fa0/11
                                                Fa0/12, Fa0/13, Fa0/14, Fa0/15
                                                Fa0/16, Fa0/17, Fa0/18, Fa0/19
                                                Fa0/20, Fa0/21, Fa0/22, Fa0/23
                                                Fa0/24, Gig0/2
100  USER_1                           active    Fa0/1
200  USER_2                           active    Fa0/2
300  USER_3                           active    Fa0/3
999  MGMT                             active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
SW_1#show in
SW_1#show interfaces tr
SW_1#show interfaces trunk 
Port        Mode         Encapsulation  Status        Native vlan
Gig0/1      on           802.1q         trunking      1

Port        Vlans allowed on trunk
Gig0/1      100,200,300,999

Port        Vlans allowed and active in management domain
Gig0/1      100,200,300,999

Port        Vlans in spanning tree forwarding state and not pruned
Gig0/1      100,200,300,999
```
SW_2
```
SW_2#show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/4, Fa0/5, Fa0/6, Fa0/7
                                                Fa0/8, Fa0/9, Fa0/10, Fa0/11
                                                Fa0/12, Fa0/13, Fa0/14, Fa0/15
                                                Fa0/16, Fa0/17, Fa0/18, Fa0/19
                                                Fa0/20, Fa0/21, Fa0/22, Fa0/23
                                                Fa0/24, Gig0/2
100  USER_1                           active    Fa0/1
200  USER_2                           active    Fa0/2
300  USER_3                           active    Fa0/3
999  MGMT                             active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
SW_2#show int
SW_2#show interfaces trun
SW_2#show interfaces trunk 
Port        Mode         Encapsulation  Status        Native vlan
Gig0/1      on           802.1q         trunking      1

Port        Vlans allowed on trunk
Gig0/1      100,200,300,999

Port        Vlans allowed and active in management domain
Gig0/1      100,200,300,999

Port        Vlans in spanning tree forwarding state and not pruned
Gig0/1      100,200,300,999

SW_2#
```
SW_3
```
SW_3#show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
100  USER_1                           active    
200  USER_2                           active    
300  VLAN0300                         active    
999  MGMN                             active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    
SW_3#show int trunk
Port        Mode         Encapsulation  Status        Native vlan
Gig0/1      on           802.1q         trunking      1
Gig0/2      on           802.1q         trunking      1

Port        Vlans allowed on trunk
Gig0/1      100,200,300,999
Gig0/2      100,200,300,999

Port        Vlans allowed and active in management domain
Gig0/1      100,200,300,999
Gig0/2      100,200,300,999

Port        Vlans in spanning tree forwarding state and not pruned
Gig0/1      100,200,300,999
Gig0/2      100,200,300,999
```
